app/views/recipes/partials/_ingredients_listing.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipes_ingredients" ON "ingredients"."id" = "recipes_ingredients"."ingredient_id" WHERE "recipes_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
---
<h2>Ingredients:</h2>
<% @recipe.ingredients.each do |ingredient| %>