app/views/recipes/index.html.erb

          <ul>
            <% recipe.ingredients.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipes_ingredients" ON "ingredients"."id" = "recipes_ingredients"."ingredient_id" WHERE "recipes_ingredients"."recipe_id" = $1  [["recipe_id", 1]]