app/views/ingredients/index.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "recipes_ingredients" ON "recipes"."id" = "recipes_ingredients"."recipe_id" WHERE "recipes_ingredients"."ingredient_id" = $1  [["ingredient_id", 3]]
---
          <ul>
            <% ingredient.recipes.each do |recipe| %>