app/views/dishes/index.html.erb

          <ul>
          <% dish.ingredients.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."dish_id" = $1  [["dish_id", 1]]