app/views/dishes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."dish_id" = $1  [["dish_id", 1]]
---
<h2>Ingredients:</h2>
<% @dish.ingredients.each do |ingredient| %>