app/controllers/dishes_controller.rb

   def index
    @dish = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def show
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bacon & Eggs"], ["created_at", 2017-03-08 07:05:20 UTC], ["updated_at", 2017-03-08 07:05:20 UTC]]

  def update
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @dish = Dish.find(params[:id])
    @dish.destroy
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 1]]