app/controllers/food_groups_controller.rb

  def index
    @food_group = FoodGroup.all
---
SELECT "food_groups".* FROM "food_groups"