app/controllers/ingredients_controller.rb

  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("name", "food_group", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sausage"], ["food_group", "Meat"], ["created_at", 2017-03-08 07:06:44 UTC], ["updated_at", 2017-03-08 07:06:44 UTC]]