app/controllers/recipes_controller.rb

   def index
    @recipe = Recipe.all
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."id" ASC

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Eggs on Toast"], ["created_at", 2017-03-15 05:31:55 UTC], ["updated_at", 2017-03-15 05:31:55 UTC]]

  def update
    @recipe = Recipe.find(params[:id])
    respond_to do |format|
      if @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "recipes" SET "contains_gluten" = $1, "contains_dairy" = $2, "updated_at" = $3 WHERE "recipes"."id" = $4  [["contains_gluten", true], ["contains_dairy", true], ["updated_at", 2017-05-15 04:14:49 UTC], ["id", 2]]